using Framework.Engine;
using System;
using System.Collections.Generic;

class TitleScene : Scene
{
    public event GameAction StartRequested;

    string[] _mainTitle =
    {
    @"██████╗ ██╗  ██╗██╗   ██╗████████╗██╗  ██╗███╗   ███╗",
    @"██╔══██╗██║  ██║╚██╗ ██╔╝╚══██╔══╝██║  ██║████╗ ████║",
    @"██████╔╝███████║ ╚████╔╝    ██║   ███████║██╔████╔██║",
    @"██╔══██╗██╔══██║  ╚██╔╝     ██║   ██╔══██║██║╚██╔╝██║",
    @"██║  ██║██║  ██║   ██║      ██║   ██║  ██║██║ ╚═╝ ██║",
    @"╚═╝  ╚═╝╚═╝  ╚═╝   ╚═╝      ╚═╝   ╚═╝  ╚═╝╚═╝     ╚═╝",
    @"                                                     ",
    @"        ███████╗████████╗ █████╗ ██████╗            ",
    @"        ██╔════╝╚══██╔══╝██╔══██╗██╔══██╗           ",
    @"        ███████╗   ██║   ███████║██████╔╝           ",
    @"        ╚════██║   ██║   ██╔══██║██╔══██╗           ",
    @"        ███████║   ██║   ██║  ██║██║  ██║           ",
    @"        ╚══════╝   ╚═╝   ╚═╝  ╚═╝╚═╝  ╚═╝          ",
    };



    public override void Load()
    {
        
    }

    public override void Unload()
    {
        
    }

    public override void Update(float deltaTime)
    {
        if (Input.IsKeyDown(ConsoleKey.Enter))
        {
            StartRequested?.Invoke();
        }

    }
    public override void Draw(ScreenBuffer buffer)
    {
        Console.OutputEncoding = System.Text.Encoding.UTF8;
        buffer.WriteLines(2, 5, _mainTitle, ConsoleColor.DarkYellow);
        buffer.WriteTextCentered(20, "Press ENTER to start!", ConsoleColor.Black, ConsoleColor.White);
        buffer.WriteTextCentered(22, "ESC: Quit", ConsoleColor.Red);
    }

}